In [5]:
import pandas as pd

---

`.melt()` creates two columns with all the variable names and all the values.

From **wide** to **long** format.

In [21]:
df = pd.DataFrame({'height': [192, 175, 20], 
                   'weight': [82, 70, 7],
                  'age': [23, 20, 14]}, 
                  index=['giulio', 'stella', 'micio'])
df

        height  weight  age
giulio     192      82   23
stella     175      70   20
micio       20       7   14

In [26]:
df.melt(['height'], # <-- the first argument fixes a column and uses it as identifier for the new column `values`
        var_name='var1',
       value_name='val1')

   height    var1  val1
0     192  weight    82
1     175  weight    70
2      20  weight     7
3     192     age    23
4     175     age    20
5      20     age    14

---

`pivot()` is the opposite of `melt()`. It unpacks a single column to multiple columns.

Reshape data (produce a “pivot” table) based on column values.

In [9]:
df = pd.DataFrame({'height': [192, 175, 20], 
                   'weight': [82, 70, 7],
                  'age': [23, 20, 14]}, 
                  index=['giulio', 'stella', 'micio'])
df

        height  weight  age
giulio     192      82   23
stella     175      70   20
micio       20       7   14

In [14]:
df_melt = df.melt(['height'], # <-- the first argument fixes a column and uses it as identifier for the new column `values`
                  var_name='var1',
                  value_name='val1')
df_melt

   height    var1  val1
0     192  weight    82
1     175  weight    70
2      20  weight     7
3     192     age    23
4     175     age    20
5      20     age    14

In [17]:
df_melt.pivot(columns='height', values='val1')

height   20    175   192
0        NaN   NaN  82.0
1        NaN  70.0   NaN
2        7.0   NaN   NaN
3        NaN   NaN  23.0
4        NaN  20.0   NaN
5       14.0   NaN   NaN

In [26]:
df_topivot = pd.DataFrame({
    'name': ['giulio', 'giulio', 'giulio', 'giulio', 'stella', 'stella', 'stella', 'stella'],
    'age': [0, 5, 10, 15, 0, 5, 10, 15],
    'weight': [5, 20, 40, 60, 3, 16, 33, 50]})
df_topivot

     name  age  weight
0  giulio    0       5
1  giulio    5      20
2  giulio   10      40
3  giulio   15      60
4  stella    0       3
5  stella    5      16
6  stella   10      33
7  stella   15      50

In [29]:
df_pivot = df_topivot.pivot(index='name', columns='age', values='weight')
df_pivot

age     0   5   10  15
name
giulio   5  20  40  60
stella   3  16  33  50

---

`.query()` select only the rows from a column that fulfill the query

In [32]:
df_topivot.query('weight>10')

     name  age  weight
1  giulio    5      20
2  giulio   10      40
3  giulio   15      60
5  stella    5      16
6  stella   10      33
7  stella   15      50

In [34]:
# alternatively, one can use a R-like syntax
df_topivot[df_topivot.weight > 10]

     name  age  weight
1  giulio    5      20
2  giulio   10      40
3  giulio   15      60
5  stella    5      16
6  stella   10      33
7  stella   15      50

In [35]:
df_topivot[df_topivot.weight > 10] == df_topivot.query('weight>10')

   name   age  weight
1  True  True    True
2  True  True    True
3  True  True    True
5  True  True    True
6  True  True    True
7  True  True    True

---

## References
1. `pandas` cheatsheet https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf